Layer (type)                 Output Shape              Param #
=================================================================
input_3 (InputLayer)         [(None, 224, 224, 3)]     0
_________________________________________________________________
conv2d (Conv2D)              (None, 224, 224, 16)      448
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 16)      0
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 8)       1160
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 8)         0
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 8)         584
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 8)         0
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 8)         584
_________________________________________________________________
up_sampling2d (UpSampling2D) (None, 56, 56, 8)         0
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 56, 56, 8)         584
_________________________________________________________________
up_sampling2d_1 (UpSampling2 (None, 112, 112, 8)       0
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 112, 112, 16)      1168
_________________________________________________________________
up_sampling2d_2 (UpSampling2 (None, 224, 224, 16)      0
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 224, 224, 3)       435
=================================================================
Total params: 4,963
Trainable params: 4,963
Non-trainable params: 0
_________________________________________________________________